# Brewfile — install with `brew bundle`
# https://github.com/Homebrew/homebrew-bundle

# ─── Terminal emulator ──────────────────────────────────
cask "kitty"

# ─── System-wide key remapping (no kext; DH-managed-Mac safe) ───
cask "hammerspoon"

# ─── JSON tooling (used by kitty-session-snapshot) ──────
brew "jq"

# ─── Fonts ──────────────────────────────────────────────
cask "font-lilex"
cask "font-lilex-nerd-font"

# ─── Shell plugins (sourced from .zshrc) ────────────────
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"

# ─── Prompt + theming ───────────────────────────────────
brew "starship"
brew "vivid"

# ─── Navigation + history ───────────────────────────────
brew "zoxide"
brew "fzf"

# ─── Files: pretty cat / ls / find / grep ───────────────
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "sd"

# ─── Git + diffing ──────────────────────────────────────
brew "git-delta"
brew "lazygit"

# ─── System monitoring + disk ───────────────────────────
brew "bottom"        # btm
brew "dust"
brew "duf"
brew "ncdu"
brew "procs"
brew "bandwhich"

# ─── Networking ─────────────────────────────────────────
brew "gping"

# ─── Reference + reading ────────────────────────────────
brew "tealdeer"      # tldr
brew "glow"          # render markdown in terminal

# ─── Per-project env ────────────────────────────────────
brew "direnv"

# ─── Container TUI (optional) ───────────────────────────
brew "lazydocker"
